app/Http/Controllers/RoleController.php

select `id`, `name`, `color` from `roles`
select `permissions`.*, `role_has_permissions`.`role_id` as `pivot_role_id`, `role_has_permissions`.`permission_id` as `pivot_permission_id` from `permissions` inner join `role_has_permissions` on `permissions`.`id` = `role_has_permissions`.`permission_id` where `role_has_permissions`.`role_id` in (1, 2, 3, 4)
---
    public function index()
    {
        $this->authorize('show_role');
        $model_query = Role::query()->with('permissions');

        return Inertia::render('Roles/Index', [
            'roles' => function () use ($model_query) {
                return $model_query->get(['id', 'name', 'color']);

select * from `permissions`
select * from `roles`
---
    public function edit(ModelsRole $role)
    {
        $this->authorize('edit_role');
        $permissions = Permission::all();
        $roles = Role::all();