app/Http/Controllers/UserController.php

    public function index(Request $request)
    {
        $this->authorize('show_user');

        $model_query = User::query()->with('roles')->canSee()->orderByDesc('id')->filter();

        return inertiaPro('Users/Index', [
            'users' => function () use ($model_query) {
                return UserResource::collection($model_query->paginate(10)->withQueryString());
            },
            'roles' => auth()->user()->roles->first()->canSee,
        ], '/users');
---
select * from `roles` order by `id` desc

    public function edit(User $user, Request $request)
    {
        $this->authorize('edit_user');

        $roles = Role::orderBy('id', "desc")->get();
---
select * from `roles` order by `id` desc

    public function create()
    {
        $this->authorize('create_user');
        $roles = auth()->user()->roles->first()->canSee;
---
select `roles`.*, `role_role`.`role_id` as `pivot_role_id`, `role_role`.`can_see_role` as `pivot_can_see_role` from `roles` inner join `role_role` on `roles`.`id` = `role_role`.`can_see_role` where `role_role`.`role_id` = 1

    public function destroy(User $user, Request $request)
    {
        $this->authorize('delete_user');
        $data = $request->validate([
            'password' => ['required', 'string', new Password],
        ]);
        if (!Hash::check($data['password'], auth()->user()->password)) {
            throw ValidationException::withMessages([
                'password' => ['The provided credentials are incorrect.'],
            ]);
        } else {
            $user->delete();
---
delete from `users` where `id` = 124

    public function deleteAll(Request $request)
    {
        $this->authorize('delete_user');
        $data = $request->validate([
            'password' => ['required', 'string', new Password],
            'users' => ['required', 'array'],
        ]);
        if (!Hash::check($data['password'], auth()->user()->password) || in_array(auth()->id(), $data['users'])) {
            $msg = 'The provided Password are incorrect.';

            if (in_array(auth()->id(), $data['users'])) {
                $msg = 'You can\'t delete your acount from her';

                $request->session()->flash('flash.banner', 'You can\'t delete your acount from her');
                $request->session()->flash('flash.bannerStyle', 'error');
            }

            throw ValidationException::withMessages([
                'password' => [$msg],
            ]);
        } else {
            User::whereIn('id', $data['users'])->each(function ($user) {
                $user->delete();
            });
---
delete from `users` where `id` = 9

    public function changeStatus(User $user, Request $request)
    {
        $this->authorize('edit_user_status');

        $user->update([
            'is_active' => !$user->is_active,
        ]);
---
update `users` set `is_active` = 1, `users`.`updated_at` = '2021-09-30 18:32:21' where `id` = 101

    public function changeAllUsersStatus(Request $request)
    {
        $this->authorize('edit_user_status');

        $data = $request->validate([
            'users' => ['required', 'array'],
        ]);

        $users = User::whereIn('id', $data['users'])->get();

        $users->each(function ($user) {
            $user->is_active = !$user->is_active;
            $user->save();
        });
---
select * from `users` where `id` in (102, 96, 94, 92)
select * from `users` where `id` in (99, 95)
update `users` set `is_active` = 1, `users`.`updated_at` = '2021-09-26 12:48:13' where `id` = 92