app/Models/User.php

select * from `users` where `id` = 1
---
    public static function boot()
    {
        parent::boot();
        static::created(function ($model) {
            Notification::send(
                User::role('admin')->whereNotIn('id', [auth()->id()])->get(),
                new UserNotification('new user created by ' . auth()->user()->name)
            );
        });
        static::updated(function ($model) {
            Notification::send(
                User::role('admin')->whereNotIn('id', [auth()->id()])->get(),
                new UserNotification($model->name . ' was updated by ' . auth()->user()->name)
            );

select `roles`.*, `role_role`.`role_id` as `pivot_role_id`, `role_role`.`can_see_role` as `pivot_can_see_role` from `roles` inner join `role_role` on `roles`.`id` = `role_role`.`can_see_role` where `role_role`.`role_id` = 1
---
    public function scopeCanSee($query)
    {
        $query->whereHas('roles', function ($q) {
            $q->whereIn('id', auth()->user()->roles->first()->canSee->pluck('id'));